[
    {
        "id": 1,
        "author": "Gianluca Busato",
        "created_utc": 1656334934.681,
        "name": "Hi",
        "num_comments": 0,
        "title": "What is a Decentralized Exchange (DEX)?",
        "permalink": "/user/busato/1",
        "thumbnail": "https://miro.medium.com/fit/c/140/140/1*XUG_YPhcUKFPw8cp7oLFiw.jpeg",
        "selftext": "DEX (Decentralized Exchange) is known for trying to offer alternatives to centralized exchanges by operating as a decentralized exchange.",
        "content": "Unlike centralized exchanges (Centralized Exchange), decentralized platforms are not supervised, in other words, when the user trades on the DEX platform, they are under the control of their own private keys. In the absence of a centralized authority, DEXs use smart contracts that are self-executing under certain conditions and record each transaction on the blockchain. The protection of these transactions represents an accelerating segment of the digital asset market and is leading to new financial products.",
        "subreddit": "sr",
        "subreddit_name_prefixed": "Blockchain",
        "ups": 1,
        "url": "fdsf",
        "price": 0
    },
    {
        "id": 2,
        "author": "Laszlo Fazekas",
        "created_utc": 1653915734.681,
        "name": "Hi",
        "num_comments": 0,
        "title": "Understanding Zero-Knowledge Proofs Through the Source Code of Tornado Cash",
        "permalink": "/user/fazekas/2",
        "thumbnail": "https://miro.medium.com/fit/c/140/140/0*uJmdJkcXqGykJWRm",
        "selftext": "Dive into the world of smart contracts with Zero-knowledge proof — Based on Wikipedia, the definition of the Zero Knowledge Proof (ZKP) is the",
        "content": "Tornado Cash is a coin mixer that you can use to anonymize your Ethereum transactions. Because of the logic of the blockchain, every transaction is public. If you have some ETH on your account, you cannot transfer it anonymously, because anybody can follow your transaction history on the blockchain. Coin mixers, like Tornado Cash, can solve this privacy problem by breaking the on-chain link between the source and the destination address by using ZKP.",
        "subreddit": "sr",
        "subreddit_name_prefixed": "Cryptography",
        "ups": 14,
        "url": "fdsf",
        "price": 0.4
    },
    {
        "id": 3,
        "author": "Jesus Solano",
        "created_utc": 1656075734.681,
        "name": "Hi",
        "num_comments": 0,
        "title": "Prompting: The new era of Natural Language Processing",
        "permalink": "/user/solano/3",
        "thumbnail": "https://miro.medium.com/fit/c/140/140/0*45HE5Oh7jfaLQj1z",
        "selftext": "Recent progress in Natural Language Processing (NLP) has shown promising results on automatic text generation.",
        "content": "Even people involved in developing Machine Learning algorithms get amazed when they look at the text generated by large pre-trained language models (PLMs) like GPT-3 or PaLM. The good quality of those models could be a direct result of being trained with 780 billion tokens, or having around 540 billions of parameters, or a better understanding of the network architecture for NLP (i.e. transformers, adapters, etc.), or all of the above. However, the question that naturally arises is whether we can leverage the complex knowledge captured by PLMs to solve tasks in other domains such as sentiment classification, entity detection, machine translation, text classification, among others. For instance, at Rappi we are interested in automatically detecting whether a dish is vegan or not by only reading the description/ingredients of the product. Notice that here we are not focusing on generating new text using the PLMs but on using the semantics, morphology and syntax learnt by the language model to extend its knowledge to a downstream task (a different task the PLM was not trained for). The good news is that we certainly can use the PLM to improve predictions on downstream tasks. But the answer, different to what you could be thinking, is not fine-tuning. Actually, the contemporary answer is: Prompting.",
        "subreddit": "sr",
        "subreddit_name_prefixed": "NLP",
        "ups": 14,
        "url": "fdsf",
        "price": 0.6
    }
]